---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.Clear
source: html/59db088f-82a7-3b8b-6997-231dd2bc295a.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```